app/controllers/travels_controller.rb

  def index
    @travels = Travel.all
---
SELECT "travels".* FROM "travels"

  def create
    @travel = Travel.new(travel_params)

    if @travel.save
---
INSERT INTO "travels" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-12-11 18:49:30.118450"], ["updated_at", "2017-12-11 18:49:30.118450"]]

  def destroy
    @travel.destroy
---
DELETE FROM "travels" WHERE "travels"."id" = ?  [["id", 11]]

    def set_travel
      @travel = Travel.find(params[:id])
---
SELECT  "travels".* FROM "travels" WHERE "travels"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]